app/views/articles/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= form.label :author_id, 'Choose Author' %><br>
    <%= form.collection_select :author_id, Author.all, :id, :name, { prompt: 'Select Author' } %>