app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "titolo articolo form"], ["body", "body articolo form"], ["created_at", "2023-10-30 17:11:42.600077"], ["updated_at", "2023-10-30 17:11:42.600077"]]
---
  def create
    #new article
    @new_article = Article.new(article_params)
    @new_article.author_id = @author.id


    #check authentication
    if @author.key !="" and @author.key !=nil
      #check if saved
      if @new_article.save

SELECT "authors".* FROM "authors" WHERE "authors"."key" = $1 LIMIT $2  [["key", "5UTJJOJR7HE9PFC7SMNQ"], ["LIMIT", 1]]
---
  def set_author
    if Author.find_by(key: params[:author_key]).present?