app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "author_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "zefiro's article"], ["body", "altricle body text"], ["created_at", "2024-01-11 00:43:23.952176"], ["updated_at", "2024-01-11 00:43:23.952176"], ["status", "public"], ["author_id", 2]]
---
  def create
    #new article
    @new_article = Article.new(article_params)
    @new_article.author_id = @author.id
      #check if saved
      if @new_article.save

UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "eee"], ["body", "...eeee secs ledi\n"], ["updated_at", "2023-10-30 17:23:55.433344"], ["id", 5]]
---
  def update
        if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
---
  def destroy
    @article.destroy!

SELECT "authors".* FROM "authors" WHERE "authors"."key" = $1 LIMIT $2  [["key", "5UTJJOJR7HE9PFC7SMNQ"], ["LIMIT", 1]]
SELECT "authors".* FROM "authors" WHERE "authors"."key" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def set_author
    if Author.find_by(key: params[:author_key]).present?
      @author = Author.find_by(key: params[:author_key])