app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("created_at", "updated_at", "name", "surname", "age") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["created_at", "2024-01-10 05:48:30.142257"], ["updated_at", "2024-01-10 05:48:30.142257"], ["name", "Leonardo"], ["surname", "Sordi"], ["age", 26]]

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "updated_at" = ?, "surname" = ? WHERE "authors"."id" = ?  [["updated_at", "2024-01-11 00:23:51.980855"], ["surname", "Sordi hwhew"], ["id", 1]]