app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "Leonardo"], ["body", "testo commento"], ["article_id", 1], ["created_at", "2024-01-07 18:40:22.839998"], ["updated_at", "2024-01-07 18:40:22.839998"]]
---
    def create
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(comment_params)