app/models/author.rb

  def articles_count
    self.articles.count
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."author_id" = ?  [["author_id", 1]]